
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка_на_расходование_ДС") Тогда
		// Заполнение шапки
		Дата_продажи = ДанныеЗаполнения.Дата_продажи;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Документ_основание = ДанныеЗаполнения.Ссылка;
		Сумма = ДанныеЗаполнения.Сумма;
		ПоступлениеТиУ = ДанныеЗаполнения.Документ_основание;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Взаиморасчеты_с_контрагентами Приход
	
	Движения.Взаиморасчеты_с_контрагентами.Записывать = Истина;
	Движение = Движения.Взаиморасчеты_с_контрагентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Период_взаимодействия = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = Сумма;
	Движение.ДокументОснование = ПоступлениеТиУ;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	Пробник.ЗаписьДанныхВРегистр(Новый Структура("СвязанныйДокумент, Контрагент, Сумма, ОсновнойДокумент", ЭтотОбъект.Ссылка,
	Контрагент, Сумма, ПоступлениеТиУ), ПоступлениеТиУ);

	
КонецПроцедуры

