
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПолучитьСвязанныеДокументы)
	ТабДок = Новый ТабличныйДокумент;
	ПолучитьСвязанныеДокументы(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПолучитьСвязанныеДокументы(ТабДок, ПараметрКоманды)
	Документы.Платежное_поручение_исход.ПолучитьСвязанныеДокументы(ТабДок, ПараметрКоманды);
КонецПроцедуры
